<?php

use yii\db\Migration;

/**
 * Class m240229_181959_seed_taj_cities
 */
class m240229_181959_seed_taj_cities extends Migration
{
    public $tableName = '{{%taj_cities}}';

    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {

        $data = [

            [1,0,'vse goroda', 'Все города','Все города',1],
            [2,0,'dushanbe', 'Душанбе', 'Душанбе',2],
            [3,0,'khudzhand', 'Худжанд', 'Худжанд',3],
            [4,0,'abdurakhmoni', 'Абдурахмони Джоми', 'Абдурахмони Джоми',4],
            [5,0,'aini', 'Айни', 'Айни',5],
            [6,0,'asht', 'Ашт', 'Ашт',6],
            [7,0,'baldzhuvan', 'Бальджуван', 'Бальджуван',7],
            [8,0,'bobodzhon', 'Бободжон Гафуров', 'Бободжон Гафуров',8],
            [9,0,'bokhtar', 'Бохтар (Курган-Тюбе)', 'Бохтар (Курган-Тюбе)',9],
            [10,0,'buston', 'Бустон (Чкаловск)', 'Бустон (Чкаловск)',10],
            [11,0,'vandzh', 'Вандж', 'Вандж',11],
            [12,0,'varzob', 'Варзоб', 'Варзоб',12],
            [13,0,'vakhdat', 'Вахдат', 'Вахдат',13],
            [14,0,'vakhsh', 'Вахш', 'Вахш',14],
            [15,0,'vose', 'Восе', 'Восе',15],
            [16,0,'gissar', 'Гиссар', 'Гиссар',16],
            [17,0,'gornaia', 'Горная Матча', 'Горная Матча',17],
            [18,0,'guliston', 'Гулистон (Кайраккум)', 'Гулистон (Кайраккум)',18],
            [19,0,'dangara', 'Дангара', 'Дангара',19],
            [20,0,'darvaz', 'Дарваз', 'Дарваз',20],
            [21,0,'devashtich', 'Деваштич (Ганчи)', 'Деваштич (Ганчи)',21],
            [22,0,'dzhabbor', 'Джаббор Расулов', 'Джаббор Расулов',22],
            [23,0,'dzhaikhun', 'Джайхун (Кумсангир)', 'Джайхун (Кумсангир)',23],
            [24,0,'dzhaloliddina', 'Джалолиддина Балхи (Руми)', 'Джалолиддина Балхи (Руми)',24],
            [25,0,'dzhami', 'Джами', 'Джами',25],
            [26,0,'dusti', 'Дусти (Джиликуль)', 'Дусти (Джиликуль)',26],
            [27,0,'zafarabad', 'Зафарабад', 'Зафарабад',27],
            [28,0,'istaravshan', 'Истаравшан', 'Истаравшан',28],
            [29,0,'istiklol', 'Истиклол', 'Истиклол',29],
            [30,0,'isfara', 'Исфара', 'Исфара',30],
            [31,0,'ishkashim', 'Ишкашим', 'Ишкашим',31],
            [32,0,'kabodien', 'Кабодиён', 'Кабодиён',32],
            [33,0,'kanibadam', 'Канибадам', 'Канибадам',33],
            [34,0,'kuliab', 'Куляб', 'Куляб',34],
            [35,0,'kushonien', 'Кушониён (Бохтар)', 'Кушониён (Бохтар)',35],
            [36,0,'lakhsh', 'Лахш (Джиргиталь)', 'Лахш (Джиргиталь)',36],
            [37,0,'levakand', 'Леваканд (Сарбанд)', 'Леваканд (Сарбанд)',37],
            [38,0,'matcha', 'Матча', 'Матча',38],
            [39,0,'mekhnatobod', 'Мехнатобод', 'Мехнатобод',39],
            [40,0,'muminabad', 'Муминабад', 'Муминабад',40],
            [41,0,'murgab', 'Мургаб', 'Мургаб',41],
            [42,0,'nosiri', 'Носири Хусрав', 'Носири Хусрав',42],
            [43,0,'nurabad', 'Нурабад', 'Нурабад',43],
            [44,0,'nurek', 'Нурек', 'Нурек',44],
            [45,0,'pendzhikent', 'Пенджикент', 'Пенджикент',45],
            [46,0,'piandzh', 'Пяндж', 'Пяндж',46],
            [47,0,'rasht', 'Рашт', 'Рашт',47],
            [48,0,'rogun', 'Рогун', 'Рогун',48],
            [49,0,'roshtkala', 'Рошткала', 'Рошткала',49],
            [50,0,'rudaki', 'Рудаки', 'Рудаки',50],
            [51,0,'rushan', 'Рушан', 'Рушан',51],
            [52,0,'sangvor', 'Сангвор (Тавильдара)', 'Сангвор (Тавильдара)',52],
            [53,0,'spitamen', 'Спитамен', 'Спитамен',53],
            [54,0,'tadzhikabad', 'Таджикабад', 'Таджикабад',54],
            [55,0,'temurmalik', 'Темурмалик', 'Темурмалик',55],
            [56,0,'tursunzade', 'Турсунзаде', 'Турсунзаде',56],
            [57,0,'faizabad', 'Файзабад', 'Файзабад',57],
            [58,0,'farkhor', 'Фархор', 'Фархор',58],
            [59,0,'khamadani', 'Хамадани', 'Хамадани',59],
            [60,0,'khovaling', 'Ховалинг', 'Ховалинг',60],
            [61,0,'khorog', 'Хорог', 'Хорог',61],
            [62,0,'khuroson', 'Хуросон', 'Хуросон',62],
            [63,0,'shamsiddin', 'Шамсиддин Шохин (Шуроабад)', 'Шамсиддин Шохин (Шуроабад)',63],
            [64,0,'shakhrinav', 'Шахринав', 'Шахринав',64],
            [65,0,'shakhriston', 'Шахристон', 'Шахристон',65],
            [66,0,'shakhritus', 'Шахритус', 'Шахритус',66],
            [67,0,'shugnan', 'Шугнан', 'Шугнан',67],
            [68,0,'iavan', 'Яван', 'ЯваЯванн',68],

        ];


        $this->batchInsert(
            $this->tableName,
            [
                'id',
                'state',
                'slug',
                'name',
                'label',
                'order',
            ],
            $data
        );

    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        try {
            $this->truncateTable($this->tableName);
            return true;
        } catch (\yii\db\Exception $e) {
            echo "m240229_181959_seed_taj_cities cannot be reverted.\n";
            echo $e->getMessage();
            return false;
        }
    }
}
